# 20. Valid Parentheses
class Solution:
    def isValid(self, s: str) -> bool:
        # Создаем хеш сочетаний скобок
        q = {
            '}': '{',
            ')': '(',
            ']': '[',
        }

        # Объявляем стек
        st = []

        # Проходимся по каждому символу в строке
        for ch in s:
            # Если скобка открывается, добавляем в стек
            if ch in {'{', '(', '['}:
                st.append(ch)
                
            # Если скобка закрывающая, а стек пуст (т.е. открывающих скобок,
            # которые сочетаются с этой закрывающей нет) или последний элемент стека
            # не сочетается с данной скобкой, возвращаем ЛОЖЬ
            else:
                if not st or q[ch]!=st[-1]:
                    return False
                # Лопаем последний элемент, если прошло условие выше
                st.pop()
        
        # Возвращаем ИСТИНУ, если стек пустой, иначе ЛОЖЬ
        return True if not st else False
